#include <iostream>
#include <windows.h>
using namespace std;


int main() {
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);

	int x, y, i, j, n, m, k;
	bool win = 1, c = 1;
	char a[3][3];

	for (i = 0; i < 3; i++) {
		for (j = 0; j < 3; j++) {
			a[i][j] = ' ';
		}
	}

	cout << "НУМЕРАЦИЯ" << endl;
	cout << "1 1 " << " 1 2 " << " 1 3" << endl;
	cout << "2 1 " << " 2 2 " << " 2 3" << endl;
	cout << "3 1 " << " 3 2 " << " 3 3" << endl;
	k = 1;
	while (win) {
		if (c && k < 9) {
			k++;
			cout << "ИГРОК Х | выберете клетку" << endl;
			for (i = 0; i < 3; i++) {
				cout << '|';
				for (j = 0; j < 3; j++)
					cout << a[i][j] << '|';
				cout << '\n' << "_______" << '\n';
			}
			cin >> n >> m;

			for (i = n - 1; i < n; i++) {
				for (j = m - 1; j < m; j++) {
					a[i][j] = 'X';
				}
			}
			c = 0;
		}
		else if (!c && k < 9){
			k++;
			cout << "ИГРОК 0 | выберете клетку" << endl;
			for (i = 0; i < 3; i++) {
				cout << '|';
				for (j = 0; j < 3; j++)
					cout << a[i][j] << '|';
				cout << '\n' << "_______" << '\n';
			}
			cin >> n >> m;

			for (i = n - 1; i < n; i++) {
				for (j = m - 1; j < m; j++) {
					a[i][j] = '0';
				}
			}
			c = 1;
		}

		if (a[0][0] == 'X' && a[0][1] == 'X' && a[0][2] == 'X' || a[1][0] == 'X' && a[1][1] == 'X' && a[1][2] == 'X' || a[2][0] == 'X' && a[2][1] == 'X' && a[2][2] == 'X' || a[0][0] == 'X' && a[1][0] == 'X' && a[2][0] == 'X' || a[0][0] == 'X' && a[1][1] == 'X' && a[2][2] == 'X' || a[2][0] == 'X' && a[1][1] == 'X' && a[0][3] == 'X' || a[0][2] == 'X' && a[1][2] == 'X' && a[2][2] == 'X') {
			cout << "ИГРОК X ПОБЕДИЛ";
			win = 0;
		}

		else if (a[0][0] == '0' && a[0][1] == '0' && a[0][2] == '0' || a[1][0] == '0' && a[1][1] == '0' && a[1][2] == '0' || a[2][0] == '0' && a[2][1] == '0' && a[2][2] == '0' || a[0][0] == '0' && a[1][0] == '0' && a[2][0] == '0' || a[0][0] == '0' && a[1][1] == '0' && a[2][2] == '0' || a[2][0] == '0' && a[1][1] == '0' && a[0][3] == '0' || a[0][2] == '0' && a[1][2] == '0' && a[2][2] == '0') {
			cout << "ИГРОК 0 ПОБЕДИЛ";
			win = 0;
		}
		else if (k == 9){
			cout << "НИЧЬЯ";
			win = 0;
		}
		
	}

}
